# task 01 == Виправте синтаксичні помилки
print("Hello", end=" ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)

"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apple = 4
pear = apple + 5 #рахуємо кількість груш
plum = pear - 2 #рахуємо кількість слив
all_trees = apple + pear + plum #рахуємо суму усіх дерев
print("Sum of all trees:", all_trees)
# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
morning_temp = 5
afternoon_temp = morning_temp - 10 # рахуємо температуру після обіду
evening_temp = afternoon_temp + 4 # рахуємо температуру надвечір
print("Temperature in the evening:", evening_temp)
# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
girls = boys / 2 # рахуємо кількіть дівчат
sick_boys = 1
missed_girls = 2

present_boys = boys - sick_boys # рахуємо загальну кількість хлопчиків які присутні
present_girls = girls - missed_girls # рахуємо загальну кількість дівчат які присутні
all_children = present_boys + present_girls # рахуємо загальну кількість усіх дітей

print("All children:", int(all_children))
# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
book_1 = 8
book_2 = book_1 + 2 # рахуємо вартість 2-ї книги
book_3 = (book_1 + book_2) / 2 # рахуємо вартість 3-ї книги
books_sum = book_1 + book_2 + book_3 # рахуємо вартість усіх книг
print("Sum of all books:", int(books_sum))
